Documents/ESB/ESB_Consumer_0529/003TestSample/SAMPLE_XML_MUST/Wallet/WA03_WalletAutoLoadInqRq.xml

<?xml version="1.0" encoding="utf-8"?>

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:v1="http://www.iisigroup.com/magiclamp/common/soapenv.xsd/v1" xmlns:v11="http://www.nextbank.com.tw/xsd/TW/Wallet/WalletAutoLoadInqRq/v1">  
  <soap:Header> 
    <v1:Header v1:mustUnderstand="true"> 
      <ChannelID>ESB</ChannelID>  
      <ServiceDomain>Wallet</ServiceDomain>  
      <OperationName>WalletAutoLoadInq</OperationName>  
      <ConsumerID>TWESB</ConsumerID>  
      <TransactionID>T1222222</TransactionID>  
      <RqTimestamp>2015-12-06T12:01:01.00+08:00</RqTimestamp> 
    </v1:Header> 
  </soap:Header>  
  <soap:Body> 
    <v11:WalletAutoLoadInqRq> 
      <v11:ServiceHeader> 
        <v11:TxnId>WA03</v11:TxnId>  
        <v11:TxnNo>WA0300001</v11:TxnNo> 
      </v11:ServiceHeader>  
      <v11:Signon> 
        <v11:CustId>ESBUSER</v11:CustId> 
      </v11:Signon>  
      <v11:ServiceBody> 
        <v11:PageNo>1</v11:PageNo>  
        <v11:NoOfPage>200</v11:NoOfPage>  
        <v11:CustPermId>A123456789</v11:CustPermId>  
        <v11:StartTxnDate>20160101</v11:StartTxnDate>  
        <v11:EndTxnDate>20160101</v11:EndTxnDate>  
        <v11:WalletCardType>1</v11:WalletCardType> 
      </v11:ServiceBody> 
    </v11:WalletAutoLoadInqRq> 
  </soap:Body> 
</soap:Envelope>
